In [1]:
import pandas as pd
from sqlalchemy import create_engine

import pymysql

In [2]:
df = pd.read_csv('title.basics.tsv', sep='\t')

C:\Users\Mateusz\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [5]:
df.drop(df.columns[[1, 3, 4, 6, 7, 8]], axis=1, inplace=True)

In [9]:
df = df[(pd.to_numeric(df['startYear'], errors='coerce') > 2014)]

In [13]:
df.rename(columns={'tconst': 'movie_id','primaryTitle': 'title','startYear': 'year'}, inplace=True)
df.head()

        movie_id                                      title  year
61136  tt0062336  El tango del viudo y su espejo deformante  2020
67690  tt0069049                 The Other Side of the Wind  2018
67836  tt0069204                            Sabse Bada Sukh  2018
87501  tt0089435                                      Kokoa  2019
89512  tt0091490                        Martina's Playhouse  2019

In [14]:
df['movie_id'] = df['movie_id'].replace(to_replace ='tt', value = '', regex = True)
df['movie_id'] = df['movie_id'].astype('int32')
df.head()

       movie_id                                      title  year
61136     62336  El tango del viudo y su espejo deformante  2020
67690     69049                 The Other Side of the Wind  2018
67836     69204                            Sabse Bada Sukh  2018
87501     89435                                      Kokoa  2019
89512     91490                        Martina's Playhouse  2019

In [15]:
tableName   = "Movies"

sqlEngine       = create_engine('mysql+pymysql://root:cinemalocal@127.0.0.1/cinema', pool_recycle=3600)
dbConnection    = sqlEngine.connect()

try:
    frame = df.to_sql(tableName, dbConnection, if_exists='fail');
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    dbConnection.execute('ALTER TABLE `Movies` ADD PRIMARY KEY (`movie_id`);')
    print("Table %s created successfully."%tableName);   
finally:
    dbConnection.close()

NameError: name 'tableName' is not defined